Revit 2024 API
Document.GetTypeOfStorage Method
 Get the storage type of the identified built-in parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public StorageType GetTypeOfStorage(
	ForgeTypeId parameterTypeId
)
Visual Basic
Public Function GetTypeOfStorage ( _
	parameterTypeId As ForgeTypeId _
) As StorageType
Visual C++
public:
StorageType GetTypeOfStorage(
	ForgeTypeId^ parameterTypeId
)
Parameters
parameterTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
Identifier of the built-in parameter.
Return Value
Storage type of the built-in parameter.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  parameterTypeId does not identify a built-in parameter. See Parameter.IsBuiltInParameter(ForgeTypeId) and Parameter.GetParameterTypeId(BuiltInParameter).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
Document Class
Autodesk.Revit.DB Namespace